Редактирование дневника
здесь надо расположить список записей и форму редактирования записи

Можно расположить список в левой колонке, но этот вариант мне не нравится.

Можно сделать табличную разметку.

Можно дивами.

<div class="edit">

    <div class="list">
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список2<br>
список3<br>
список4<br>
список5<br>
список6<br>
список7<br>
список8<br>
список9<br>
список11<br>
список1<br>
список2<br>
список3<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список2<br>
список3<br>
список4<br>
список5<br>
список6<br>
список7<br>
список8<br>
список9<br>
список11<br>
список1<br>
список2<br>
список3<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список<br>
список2<br>
список3<br>
список4<br>
список5<br>
список6<br>
список7<br>
список8<br>
список9<br>
список11<br>
список1<br>
список2<br>
список3<br>
список4<br>
список<br>
    </div>

    <div class="form1">
форма редактирования элемента
    </div>

</div>


<?php
